{
    "name" : "John Iceberg Velez",
    "titles" : ["Web Developer", "Junior Software Engineer"],
    "address" : "8311, Bislig City, PH",
    "contacts" : {
        "github" : "https://github.com/icevelez/",
        "gitea" : null,
        "gitlab" : null,
        "website" : "https://icevelez.github.io/",
        "upwork" : "https://www.upwork.com/freelancers/~0187cb151c52b94ce8",
        "linkedin" : "https://www.linkedin.com/in/iceberg-velez/",
        "email_address" : "icevelezdev@gmail.com"
    },
    "employments" : [
        {
            "organization" : "Brush Media Group (SermonShots)",
            "address" : "38555 Crossville, Tennesse, US", 
            "position" : ["Jr. Software Engineer"],
            "start" : "Aug 2023",
            "end" : "Nov 2024",
            "accomplishments" : [
                "Handling the platform UI redesign of SermonShots alongside code improvements and fixes",
                "Creating an API called \"webhook registry service\" for service-to-service communication using API keys",
                "Creating an application called \"Sermon Translate\" that translate real-time audio to a desired language output",
                "Taking in a side project of researching and experimenting with different/new tools and technologies and report back my findings",
                "Building my character by taking ownership and initiative of a given project and communicating to the team of any updates and/or blockers to the project",
                "Creating a psuedo data-structure using JSON to genralize rendering of videos with Remotion by creating basic components such as images, videos, and subtitle elements then scaling them using AWS Lambda",
                "Creating and integrating an internal Python FAST API to generate a written recap of a video input using AI"
            ]
        },
        {
            "organization" : "Government of Bislig City",
            "address" : "8311 Bislig City, Poblacion, Surigao Del Sur, PH",
            "position" : ["Computer Programmer"],
            "start" : "Jan 2022",
            "end" : "Jul 2023",
            "accomplishments" : [
                "Actively worked on R&D for code quality improvements, development speed, web application performance and optimizations.",
                "Introduced new technologies, concepts, and educational sources to the development team and assist in improving each other.",
                "Proposed and demonstrated the use of Windows AD DS, creating a centralized identity solution, network drive for storage, and group policies enforcing strict privileges.",
                "Developed a service oriented architecture, creating the foundation for a unified scalable, secure, and performant web system.",
                "Designed and developed a proprietary SSO solution to centralized authentication, authorization, and logging of different HTTP APIs.",
                "Designed and developed the \"Franchasing System\" for the City Economic Enterprise and Development Office.",
                "Designed and deployed a CI/CD API that automates production deployment.",
                "Designed and developed version 2 and 3 of the Electronic Daily Time Record web application",
                "Worked in a team to develop and facilitate the Competition Management System for Ms.Diwata 2022",
                "Worked in a team to develop the LGU Olympics System for LGU Olympics 2023",
                "Developed a text messaging RESTFul API for multi-purpose use cases such as notifications and 2FA OTP using Fastify and Android ADB.",
                "Deployed a Hyper-converged infrastructure to create, deploy, and manage virtual servers using Ubuntu Server and QEMU.",
                "Deployed a website for application documentation and software development insight using Docusaurus.",
                "Deployed a Git Server to have control, privacy, and sovereignty of Bislig City's project source codes using Gitea."
            ]
        }
    ],
    "educations" : [
        {
            "institution" : "Ateneo De Davao University",
            "address" : "Roxas Avenue, 8016 Davao City, Philippines",
            "start" : "2018",
            "end" : "Present",
            "degree" : "Computer Science - Information and Technology",
            "accomplishments" : ["CSAA Tutor 2021-2022"]
        }
    ],
    "languages" : ["SQL", "PHP", "JavaScript", "TypeScript", "Python", "Go"],
    "frameworks_and_libraries" : ["JQuery", "Svelte", "Angular", "Nest.js", "Solid.js", "React", "Tailwind", "Express", "Fastify", "Fast API", "Wordpress", "Elementor"],
    "infrastructure_and_tools" : ["Windows & Ubuntu Server", "MySQL", "PostgreSQL", "MongoDB", "Redis", "NGINX", "Node.js", "TypeORM", "Playwright", "Docker", "Tmux", "Google Cloud Storage", "AWS Lambda"]
}